benchmarks/logs/2026-04-30_17-48-54/burst_get_index.txt
Running 30s test @ http://localhost:8080/
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   318.23us  116.98us   4.17ms   72.12%
    Req/Sec    15.57k     2.39k   18.87k    52.66%
  Latency Distribution
     50%  286.00us
     75%  380.00us
     90%  481.00us
     99%  670.00us
  932969 requests in 30.10s, 0.94GB read
Requests/sec:  30995.53
Transfer/sec:     32.10MB