benchmarks/logs/2026-04-30_17-48-54/soak_get_bookmarks.txt
Running 5m test @ http://localhost:8080/bookmarks
  1 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   777.46us  415.65us   5.77ms   62.11%
    Req/Sec     5.19k    99.86     5.34k    73.40%
  Latency Distribution
     50%  755.00us
     75%    1.11ms
     90%    1.38ms
     99%    1.74ms
  1549981 requests in 5.00m, 16.36GB read
Requests/sec:   5166.60
Transfer/sec:     55.83MB